% ----------------采用三邊定位法對未知節點定位-------------------------------

%{
    clc命令是用來清除命令窗口的內容。不管開啟多少個應用程序，命令窗口只有一個，
    所以clc無論是在腳本m文件或者函數m文件調用時，clc命令都會清除命令窗口的內容。

    clear命令可以用來清除工作空間的內容。MATLAB有個基本的工作空間，用base標識，
    此外，當打開一個函數m文件時，可能會產生很多工作空間。每一個函數對應一個工作空間。
%}

clear;
cx(1) = 2497154;
cy(1) = 12119268;
cx(2) = 2496822;
cy(2) = 12119437;
cx(3) = 2496715;
cy(3) = 12118766;
da=0.4854884047180578;
db=1.187161500156535;
dc=3.3468610409051767;
% 計算定位坐標
[locx,locy] = triposition(cx(1),cy(1),da,cx(2),cy(2),db,cx(3),cy(3),dc);      
plot(locx,locy,'r*');
legend('參考節點','盲節點','定位節點','Location','SouthEast');  
title('三邊測量法的定位');

derror = sqrt((locx-mx)^2 + (locy-my)^2);
disp(derror);